# Taps
tap "sst/tap"

# CLI Tools - Currently Installed
brew "brotli"
brew "c-ares"
brew "ca-certificates"
brew "codex"
brew "docker"
brew "docker-completion"
brew "eza"                    # Better ls replacement
brew "fzf"                    # Fuzzy finder
brew "gemini-cli"
brew "gettext"
brew "gh"                     # GitHub CLI
brew "icu4c@77"
brew "lazydocker"             # Docker TUI
brew "lazygit"                # Git TUI
brew "libgit2"
brew "libnghttp2"
brew "libnghttp3"
brew "libngtcp2"
brew "libssh2"
brew "libunistring"
brew "libuv"
brew "lpeg"
brew "luajit"
brew "luv"
brew "lz4"
brew "mailhog"                # Email testing tool
brew "mise"                   # Runtime version manager
brew "neovim"                 # Modern vim
brew "luarocks"               # Lua package manager (for nvim plugins)
# brew "node"                   # Node.js managed by mise
brew "opencode"
brew "openssl@3"
brew "pcre2"
brew "readline"
brew "ripgrep"                # Fast text search
brew "simdjson"
brew "sqlite"
brew "starship"               # Cross-shell prompt
brew "tree-sitter"
brew "unibilium"
brew "usage"
brew "utf8proc"
brew "uvwasi"
brew "xz"
brew "zellij"                 # Terminal multiplexer
brew "zoxide"                 # Smart cd replacement
# brew "zsh-syntax-highlighting" # Installed as Oh My Zsh plugin
brew "zstd"

# Additional useful CLI tools (not currently installed)
brew "bat"                    # Better cat with syntax highlighting
brew "tree"                   # Directory tree view
brew "wget"                   # Download files
brew "jq"                     # JSON processor
brew "htop"                   # Process viewer
brew "tldr"                   # Simplified man pages
brew "mas"                    # Mac App Store CLI
brew "git"                    # Git version control
brew "hub"                    # GitHub CLI wrapper
brew "delta"                  # Better git diff
# brew "zsh-autosuggestions"    # Installed as Oh My Zsh plugin

# Applications - Currently Installed
cask "bitwarden"              # Password manager
cask "brave-browser"          # Privacy-focused browser
cask "docker-desktop"         # Docker GUI
cask "fantastical"            # Calendar app
cask "figma"                  # Design tool
cask "font-jetbrains-mono-nerd-font" # Programming font
cask "ghostty"                # Terminal emulator
cask "github"                 # GitHub Desktop
cask "raycast"                # Launcher and productivity
cask "readdle-spark"          # Email client
cask "slack"                  # Team communication
cask "spotify"                # Music streaming
cask "warp"                   # AI terminal
cask "whatsapp"               # Messaging
cask "zoom"                   # Video conferencing

# Additional useful applications (not currently installed)
# cask "visual-studio-code"     # Code editor
# cask "iterm2"                 # Better terminal
# cask "firefox"                # Web browser
# cask "google-chrome"          # Web browser
cask "rectangle"              # Window management
cask "the-unarchiver"         # Archive utility
cask "discord"                # Gaming/community chat

# Additional fonts
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-caskaydia-mono-nerd-font"

# Development databases/services (uncomment if needed)
# brew "postgresql"           # PostgreSQL database
# brew "redis"                # Redis cache/database
# brew "mongodb-community"    # MongoDB database

# Optional productivity apps (uncomment if needed)
# cask "notion"               # Notes and productivity
# cask "obsidian"             # Knowledge management
